# ContextualHelp Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ContextualHelp Methods
ContextualHelp Class See Also
---
The ContextualHelp type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| Launch | Launches and displays the help topic specified by the contents of this ContextualHelp object. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ContextualHelp Class
Autodesk.Revit.UI Namespace